oaq_specification/examples/dot/resonator_spectroscopy.dot
strict digraph "" {
    node [label="\N"];
    "NumericExpression1" [label="6000000000", shape=box];
    "NumericExpression2" [label="7000000000", shape=box];
    "NumericExpression3" [label="10000000", shape=box];
    "NumericRange1" [label="SteppedRange", shape=box];
    "NumericRange1" -> "NumericExpression1"  [label="InclusiveStart", style=dashed];
    "NumericRange1" -> "NumericExpression2"  [label="Step", style=dashed];
    "NumericRange1" -> "NumericExpression3"  [label="ExclusiveEnd", style=dashed];
    "NumericParameter1" [label="NumericParameter", shape=box];
    "NumericExpression4" [label="0", shape=box];
    "NumericExpression5" [label="1", shape=box];
    "NumericExpression6" [label="1000", shape=box];
    "NumericRange2" [label="SteppedRange", shape=box];
    "NumericRange2" -> "NumericExpression4"  [label="InclusiveStart", style=dashed];
    "NumericRange2" -> "NumericExpression5"  [label="Step", style=dashed];
    "NumericRange2" -> "NumericExpression6"  [label="ExclusiveEnd", style=dashed];
    "NumericParameter2" [label="NumericParameter", shape=box];
    "NumericExpression7" [label="200", shape=box];
    "Port1" [label="Port", shape=box];
    "Port1" -> "NumericExpression7"  [label="Id", style=dashed];
    "Frequency1" [label="7 GHz", shape=box];
    "Radians2" [label="0 rad", shape=box];
    "Frequency3" [label="20 MHz", shape=box];
    "Frame1" [label="Frame", shape=box];
    "Frame1" -> "Port1"  [label="Port", style=dashed];
    "Frame1" -> "Frequency1"  [label="Frequency", style=dashed];
    "Frame1" -> "Radians2"  [label="Phase", style=dashed];
    "Frame1" -> "Frequency3"  [label="IntermediateFrequency", style=dashed];
    "Hertz4" [label="Hertz", shape=box];
    "Hertz4" -> "NumericParameter1"  [label="Value", style=dashed];
    "Interval5" [label="1 μs", shape=box];
    "Waveform1" [label="ConstantWaveform", shape=box];
    "Waveform1" -> "Interval5"  [label="Duration", style=dashed];
    "Instruction6" [label="ModulatedPulse", shape=box];
    "Instruction6" -> "Frame1"  [label="Frame", style=dashed];
    "Instruction6" -> "Waveform1"  [label="Envelope", style=dashed];
    "NumericExpression8" [label="0.2", shape=box];
    "Amplitude6" [label="Amplitude", shape=box];
    "Amplitude6" -> "NumericExpression8"  [label="Value", style=dashed];
    "Instruction6" -> "Amplitude6"  [label="Amplitude", style=dashed];
    "NumericExpression9" [label="300", shape=box];
    "Port2" [label="Port", shape=box];
    "Port2" -> "NumericExpression9"  [label="Id", style=dashed];
    "Interval7" [label="1 μs", shape=box];
    "ComplexRangeExpression1" [label="AcquisitionComplexRangeResult", shape=box];
    "Instruction7" [label="AdcAcquisition", shape=box];
    "Instruction7" -> "Port2"  [label="Port", style=dashed];
    "Instruction7" -> "Interval7"  [label="Duration", style=dashed];
    "Instruction7" -> "ComplexRangeExpression1"  [label="Result", style=dashed];
    "Instruction8:Alignment" [label="StartToStart", shape=box];
    "Instruction8:Relationship" [label="InstructionRelationship", shape=box];
    "Instruction8:Relationship" -> "Instruction8:Alignment"  [label="Alignment", style=dashed];
    "Instruction8" [label="Dependency", shape=box];
    "Instruction8" -> "Instruction8:Relationship"  [label="Relationship", style=dashed];
    "Instruction8" -> "Instruction6"  [label="Lhs", style=dashed];
    "Instruction8" -> "Instruction7"  [label="Rhs", style=dashed];
    "ComplexRangeExpression2" [label="Demodulation", shape=box];
    "ComplexRangeExpression2" -> "Frame1"  [label="Frame", style=dashed];
    "ComplexRangeExpression2" -> "ComplexRangeExpression1"  [label="Trace", style=dashed];
    "ComplexRangeExpression3:Values" [label="(0, 1), (2, 3), (4, 5), ..., (1998, 1999)", shape=box];
    "ComplexRangeExpression3" [label="LiteralComplexRange", shape=box];
    "ComplexRangeExpression3" -> "ComplexRangeExpression3:Values"  [label="Values", style=dashed];
    "ComplexExpression1" [label="ComplexDotProduct", shape=box];
    "ComplexExpression1" -> "ComplexRangeExpression2"  [label="Lhs", style=dashed];
    "ComplexExpression1" -> "ComplexRangeExpression3"  [label="Rhs", style=dashed];
    "ComplexRangeRegister1" [label="ComplexRangeRegister", shape=box];
    "Instruction9" [label="ComplexAppend", shape=box];
    "Instruction9" -> "ComplexExpression1"  [label="Input", style=dashed];
    "Instruction9" -> "ComplexRangeRegister1"  [label="Output", style=dashed];
    "Instruction10:Alignment" [label="EndToStart", shape=box];
    "Instruction10:Relationship" [label="InstructionRelationship", shape=box];
    "Instruction10:Relationship" -> "Instruction10:Alignment"  [label="Alignment", style=dashed];
    "Instruction10" [label="Dependency", shape=box];
    "Instruction10" -> "Instruction10:Relationship"  [label="Relationship", style=dashed];
    "Instruction10" -> "Instruction8"  [label="Lhs", style=dashed];
    "Instruction10" -> "Instruction9"  [label="Rhs", style=dashed];
    "Instruction11" [label="DetuneFrame", shape=box];
    "Instruction11" -> "Frame1"  [label="Frame", style=dashed];
    "Instruction11" -> "Hertz4"  [label="Detuning", style=dashed];
    "Instruction11" -> "T0IsJobStart"  [label="PhaseReference", style=dashed];
    "Instruction11" -> "Instruction10"  [label="Scope1", style=dashed];
    "Instruction12:Alignment" [label="EndToStart", shape=box];
    "Instruction12:Relationship" [label="InstructionRelationship", shape=box];
    "Instruction12:Relationship" -> "Instruction12:Alignment"  [label="Alignment", style=dashed];
    "Function13" [label="Function", shape=box];
    "Function13" -> "NumericParameter2"  [label="Parameter", style=dashed];
    "Function13" -> "Instruction11"  [label="Body1", style=dashed];
    "Instruction12" [label="ForEachNumeric", shape=box];
    "Instruction12" -> "NumericRange2"  [label="Source", style=dashed];
    "Instruction12" -> "Instruction12:Relationship"  [label="Relationship", style=dashed];
    "Instruction12" -> "Function13"  [label="Body", style=dashed];
    "Instruction14:Alignment" [label="EndToStart", shape=box];
    "Instruction14:Relationship" [label="InstructionRelationship", shape=box];
    "Instruction14:Relationship" -> "Instruction14:Alignment"  [label="Alignment", style=dashed];
    "Function15" [label="Function", shape=box];
    "Function15" -> "NumericParameter1"  [label="Parameter", style=dashed];
    "Function15" -> "Instruction12"  [label="Body1", style=dashed];
    "Instruction14" [label="ForEachNumeric", shape=box];
    "Instruction14" -> "NumericRange1"  [label="Source", style=dashed];
    "Instruction14" -> "Instruction14:Relationship"  [label="Relationship", style=dashed];
    "Instruction14" -> "Function15"  [label="Body", style=dashed];
    "ComplexRangeExpression4:BufferDimensions" [label="100, 1000", shape=box];
    "ComplexRangeExpression4" [label="ComplexAverageOver", shape=box];
    "ComplexRangeExpression4" -> "ComplexRangeRegister1"  [label="Source", style=dashed];
    "ComplexRangeExpression4" -> "ComplexRangeExpression4:BufferDimensions"  [label="BufferDimensions", style=dashed];
    "ComplexRangeExpression4" -> "1"  [label="AveragingAxis", style=dashed];
    "ComplexRangeRegister2" [label="ComplexRangeRegister", shape=box];
    "Instruction16" [label="ComplexAssign", shape=box];
    "Instruction16" -> "ComplexRangeExpression4"  [label="Input", style=dashed];
    "Instruction16" -> "ComplexRangeRegister2"  [label="Output", style=dashed];
    "Instruction17:Alignment" [label="EndToStart", shape=box];
    "Instruction17:Relationship" [label="InstructionRelationship", shape=box];
    "Instruction17:Relationship" -> "Instruction17:Alignment"  [label="Alignment", style=dashed];
    "Instruction17" [label="Dependency", shape=box];
    "Instruction17" -> "Instruction17:Relationship"  [label="Relationship", style=dashed];
    "Instruction17" -> "Instruction14"  [label="Lhs", style=dashed];
    "Instruction17" -> "Instruction16"  [label="Rhs", style=dashed];
    "Job:ComplexRangeOutputs" [label="ComplexRangeOutputs", shape=box];
    "Job:ComplexRangeOutputs" -> "ComplexRangeRegister2"  [label="0", style=dashed];
    "Job" [label="Job", shape=box];
    "Job" -> "Instruction17"  [label="EntryPoint1", style=dashed];
    "Job" -> "Job:ComplexRangeOutputs"  [label="ComplexRangeOutputs", style=dashed];
}
